{
	"app": {
		"lang": {
			"english": "अंग्रेज़ी",
			"hindi": "हिंदी",
			"kannada": "कन्नडा"
		}
	},
	"home": {
		"bha": "भा",
		"designation": "एक जुनूनी सॉफ्टवेयर डेवलपर",
		"from": "से",
		"hello": "नमस्ते",
		"name_intro": "मेरा नाम कार्तिक है",
		"ra": "र",
		"tha": "त"
	},
	"intro": {
		"about_me": "मेरे बारे में",
		"p1": "मैंने BCA की पढ़ाई पूरी की है और KodNest में एक गहन इंटर्नशिप के दौरान मैंने खुद को Java Full-Stack Web Development में निपुण बनाया। वर्तमान में, मैं Star Knowledge Ventures में एक Trainee Software Developer के रूप में काम कर रहा हूँ, जहां मुझे रियल एस्टेट, हेल्थकेयर, स्टॉक ट्रेडिंग और अन्य क्षेत्रों में विभिन्न प्रोजेक्ट्स पर काम करने का अवसर मिला है। इन अनुभवों ने मुझे .NET, Angular, और Azure टेक्नोलॉजीज में कुशल बनाया है और नवाचार व टीमवर्क के प्रति मेरा जुनून और बढ़ाया है।",
		"p2": "मुझे API ज़ाइन करना, परफॉर्मेंस ऑप्टिमाइज़ करना और Azure डिप्लॉयमेंट्स को सुचारू रूप से लागू करना पसंद है। चाहे यह साइट की लोडिंग टाइम को 60% तक कम करना हो या ग्राउंड अप से मजबूत एप्लिकेशन बनाना, मैं हर प्रोजेक्ट को व्यावहारिक दृष्टिकोण और परिणाम-उन्मुख मानसिकता के साथ पूरा करता हूँ।",
		"p3": "काम के अलावा, मुझे ऐसे साइड प्रोजेक्ट्स बनाना पसंद है जो मज़ेदार और उद्देश्यपूर्ण दोनों हों, जैसे कि मेरा CPU Scheduling Visualizer, जिसे मैंने उभरते हुए डेवलपर्स के लिए जटिल अवधारणाओं को सरल बनाने के लिए डिज़ाइन किया। मैं निरंतर सीखने और सहयोग में विश्वास करता हूँ और हमेशा नई चुनौतियों को स्वीकार करने और नए विचारों को आगे बढ़ाने के लिए तैयार रहता हूँ।",
		"p4": "चलिए जुड़ते हैं और कुछ असाधारण निर्माण करते हैं!"
	},
	"projects": {
		"CPU Scheduling Visualizer": {
			"description": "जूनियर्स को विभिन्न CPU Scheduling Algorithms के बीच के अंतर को बेहतर ढंग से समझने में मदद करने के लिए एक साइड प्रोजेक्ट विकसित किया गया है। इस साइट में FCFS, SJF, RR, और Priority Scheduling एल्गोरिदम शामिल हैं।",
			"heading": "सीपियु  सचेंडुलिंग विसुअलिज़ेर"
		},
		"description": "विवरण",
		"heading": "प्रोजेक्ट्स",
		"Paying Guest Management System": {
			"description": "PG बिल्डिंग मालिकों के लिए .NET और C# का उपयोग करके एक उपयोगकर्ता-अनुकूल पेलिंग गेस्ट्स प्रबंधन सॉफ्टवेयर विकसित किया गया है। यह मैन्युअल प्रक्रियाओं को बदलकर मेहमानों और भवन प्रबंधन को सुचारू बनाता है। इसमें स्टाफ प्रबंधन, अतिथि प्रवेश/हटाना, शुल्क संग्रह, आगंतुक ट्रैकिंग और रिपोर्टिंग जैसी सुविधाएं शामिल हैं।",
			"heading": "पेइंग गेस्ट मैनेजमेंट सिस्टम"
		},
		"Simple Library Surfer": {
			"description": "ग्रंतालय प्रबंधन के लिए .NET WinForms का उपयोग करके एक मजबूत CRUD एप्लिकेशन विकसित किया, जो लाइब्रेरियन्स को पुस्तक डेटा जैसे जोड़ना, हटाना, अपडेट करना और देखना कुशलतापूर्वक प्रबंधित करने में सक्षम बनाता है। इसमें PDF रिपोर्ट जेनरेशन और उन्नत पुस्तक खोज कार्यक्षमता की विशेषताएं शामिल हैं।",
			"heading": "सिंपल लाइब्रेरी सर्फर"
		},
		"skills_learnt": "सीखे गए कौशल",
		"Solar System": {
			"description": "हमारे मिल्की वे गैलेक्सी में 'सौरमंडल' को प्रदर्शित करने वाली एक स्थिर वेबसाइट। यह अनावश्यक डेटा को हटा देती है और ग्रहों की संपूर्ण जानकारी देखने के लिए एक छोटा लेकिन प्रभावशाली वेबसाइट प्रदान करती है।",
			"heading": "सोलर सिस्टम"
		},
		"tech_stack": "टेक स्टैक",
		"view_code": "कोड देखें",
		"view_website": "वेबसाइट देखें"
	},
	"skills": {
		"backend": "बैक एंड",
		"frameworks_and_technologies": "फ्रेमवर्कस और टेक्नोलॉजीस ",
		"frontend": "फ़्रंट एंड",
		"heading": "कौशल"
	}
}
