{
	"app": {
		"lang": {
			"english": "अंग्रेज़ी",
			"hindi": "हिंदी",
			"kannada": "कन्नडा"
		}
	},
	"home": {
		"bha": "भा",
		"designation": "एक उत्साही सॉफ्टवेयर डेवलपर",
		"from": "से",
		"hello": "नमस्ते",
		"name_intro": "मेरा नाम कार्तिक है",
		"ra": "र",
		"tha": "त"
	},
	"intro": {
		"about_me": "मेरे बारे में",
		"p1": "मैं एक बीसीए स्नातक हूं, जो कोडनेस्ट में एक इमर्सिव इंटर्नशिप के दौरान सफल हुआ, जहां मैंने खुद को जावा फुल-स्टैक वेब डेवलपमेंट में डुबो दिया। वर्तमान में, स्टार नॉलेज वेंचर्स में एक प्रशिक्षु सॉफ्टवेयर डेवलपर के रूप में, मुझे रियल एस्टेट, हेल्थकेयर, स्टॉक ट्रेडिंग और अन्य क्षेत्रों में फैली विविध परियोजनाओं पर काम करने का अवसर मिला है। इन अनुभवों ने .NET, एंगुलर और एज़्योर प्रौद्योगिकियों में मेरे कौशल को तेज किया है, जबकि नवाचार और टीम वर्क के लिए मेरे जुनून को बढ़ाया है।",
		"p2": "मैं कुशल एपीआई तैयार करने, प्रदर्शन को अनुकूलित करने और निर्बाध Azure तैनाती प्रदान करने में गर्व महसूस करता हूं। चाहे वह साइट लोड समय को 60% तक कम करना हो या स्क्रैच से मजबूत एप्लिकेशन बनाना हो, मैं हर प्रोजेक्ट को व्यावहारिक मानसिकता और परिणामों पर ध्यान केंद्रित करके देखता हूं।",
		"p3": "काम के बाहर, मुझे ऐसे साइड प्रोजेक्ट बनाने में मजा आता है जो उद्देश्य के साथ मनोरंजन को जोड़ता है, जैसे कि मेरा सीपीयू शेड्यूलिंग विज़ुअलाइज़र, जो उभरते डेवलपर्स के लिए जटिल अवधारणाओं को सरल बनाने के लिए डिज़ाइन किया गया है। मैं निरंतर सीखने और सहयोग में दृढ़ विश्वास रखता हूं, हमेशा नई चुनौतियों का पता लगाने और नए विचारों को सामने लाने के लिए उत्सुक रहता हूं।",
		"p4": "आइए एक साथ जुड़ें और कुछ उल्लेखनीय बनाएं!"
	},
	"projects": {
		"CPU Scheduling Visualizer": {
			"description": "जूनियर्स को विभिन्न सीपीयू शेड्यूलिंग एल्गोरिदम के बीच अंतर को बेहतर ढंग से समझने में मदद करने के लिए एक साइड प्रोजेक्ट विकसित किया गया है। साइट में एफसीएफएस, एसजेएफ, आरआर और प्राथमिकता शेड्यूलिंग एल्गोरिदम शामिल हैं |",
			"heading": "सीपियु  सचेंडुलिंग विसुअलिज़ेर"
		},
		"description": "विवरण",
		"heading": "प्रोजेक्ट्स",
		"Paying Guest Management System": {
			"description": "पीजी भवन मालिकों के लिए एक उपयोगकर्ता-अनुकूल पेइंग गेस्ट मैनेजमेंट सॉफ्टवेयर सी के साथ .NET का उपयोग करके विकसित किया गया है |",
			"heading": "पेइंग गेस्ट मैनेजमेंट सिस्टम"
		},
		"Simple Library Surfer": {
			"description": "लाइब्रेरी प्रबंधन के लिए एक मजबूत .NET WinForms CRUD एप्लिकेशन बनाया गया, जो लाइब्रेरियन को सम्मिलन, विलोपन, अद्यतन करने और देखने सहित पुस्तक डेटा को कुशलतापूर्वक संभालने में सक्षम बनाता है। पीडीएफ रिपोर्ट निर्माण और उन्नत पुस्तक खोज कार्यक्षमता की सुविधाएँ |",
			"heading": "सिंपल लाइब्रेरी सर्फर"
		},
		"skills_learnt": "सीखे गए कौशल",
		"Solar System": {
			"description": "आकाशगंगा में हमारे 'सौर तंत्र' को प्रदर्शित करने वाली एक स्थिर वेबसाइट। यह अनावश्यक डेटा को हटा देता है और ग्रहों के समग्र डेटा को देखने के लिए एक छोटी लेकिन शक्तिशाली वेबसाइट प्रदान करता है |",
			"heading": "सोलर सिस्टम"
		},
		"tech_stack": "टेक स्टैक",
		"view_code": "कोड देखें",
		"view_website": "वेबसाइट देखें"
	},
	"skills": {
		"backend": "बैक एंड",
		"frameworks_and_technologies": "फ्रेमवर्कस और टेक्नोलॉजीस ",
		"frontend": "फ़्रंट एंड",
		"heading": "कौशल"
	}
}
