{
	"app": {
		"lang": {
			"english": "ಆಂಗ್ಲ",
			"hindi": "ಹಿಂದಿ",
			"kannada": "ಕನ್ನಡ"
		}
	},
	"home": {
		"bha": "ಭಾ",
		"designation": "ಒಬ್ಬ ಉತ್ಸಾಹಿ ಸಾಫ್ಟ್‌ವೇರ್ ಡೆವಲಪರ್",
		"from": "ದಿಂದ",
		"hello": "ನಮಸ್ಕಾರ",
		"name_intro": "ನಾನು ಕಾರ್ತಿಕ್",
		"ra": "ರ",
		"tha": "ತ"
	},
	"intro": {
		"about_me": "ನನ್ನ ಬಗ್ಗೆ",
		"p1": "ನಾನು BCA ಪದವಿ ಪಡೆದಿದ್ದೇನೆ ಮತ್ತು KodNestನಲ್ಲಿ ಒಂದು ಆಳವಾದ ಇಂಟರ್ನ್‌ಶಿಪ್ ವೇಳೆ Java Full-Stack Web Developmentನಲ್ಲಿ ನನ್ನನ್ನು ಮುನ್ನೋಡಿಯಾಗಿ ತೊಡಗಿಸಿಕೊಂಡಿದ್ದೇನೆ. ಪ್ರಸ್ತುತ, ನಾನು Star Knowledge Venturesನಲ್ಲಿ Trainee Software Developer ಆಗಿ ಕೆಲಸ ಮಾಡುತ್ತಿದ್ದು, ರಿಯಲ್ ಎಸ್ಟೇಟ್, ಆರೋಗ್ಯಸೇವೆ, ಷೇರು ವ್ಯಾಪಾರ ಮತ್ತು ಇತರ ಕ್ಷೇತ್ರಗಳನ್ನು ಒಳಗೊಂಡ ವಿಭಿನ್ನ ಪ್ರಾಜೆಕ್ಟ್‌ಗಳಲ್ಲಿ ಕೆಲಸ ಮಾಡುವ ಅವಕಾಶವನ್ನು ಪಡೆದಿದ್ದೇನೆ. ಈ ಅನುಭವಗಳು ನನ್ನ .NET, Angular, ಮತ್ತು Azure ತಂತ್ರಜ್ಞಾನಗಳ ಕೌಶಲ್ಯವನ್ನು ಹೆಚ್ಚಿಸಿದ್ದು, ನಾವೀನ್ಯತೆ ಮತ್ತು ತಂಡದ ಕೆಲಸದ ಪ್ರತಿ ನನ್ನ ಉತ್ಸಾಹವನ್ನು ಹೆಚ್ಚಿಸಿವೆ.",
		"p2": "ನಾನು ಸಮರ್ಥ APIಗಳನ್ನು ರಚಿಸುವುದು, ಕಾರ್ಯಕ್ಷಮತೆಯನ್ನು ಸುಧಾರಿಸುವುದು ಮತ್ತು ಸುಗಮವಾದ Azure ಡಿಪ್ಲಾಯ್‌ಮೆಂಟ್‌ಗಳನ್ನು ನಿಭಾಯಿಸುವುದರಲ್ಲಿ ಹೆಮ್ಮೆ ಪಡುತ್ತೇನೆ. ಸೈಟ್ ಲೋಡ್ ಟೈಮ್ ಅನ್ನು 60% ಕ್ಕಷ್ಟು ಕಡಿಮೆ ಮಾಡುವುದು ಅಥವಾ ಬೇರೆಯಿಂದ ಪ್ರಬಲ ಅಪ್ಲಿಕೇಶನ್‌ಗಳನ್ನು ನಿರ್ಮಿಸುವುದೇ ಆಗಿರಲಿ, ನಾನು ಪ್ರತಿಯೊಂದು ಪ್ರಾಜೆಕ್ಟ್‌ನಲ್ಲೂ ಕೈಗೂಡಿಸುವ ಮನೋಭಾವನೆ ಮತ್ತು ಫಲಿತಾಂಶ ಉನ್ನತ ಮನೋವೃತ್ತಿಯನ್ನು ಕಾಪಾಡಿಕೊಂಡಿದ್ದೇನೆ.",
		"p3": "ಕೆಲಸದ ಹೊರತಾಗಿ, CPU Scheduling Visualizer ಹಾದಿ‌ನಲ್ಲಿ ಹೊಸದಾಗಿ ವಿದ್ಯಾರ್ಥಿಗಳಿಗೆ ಸಂಕೀರ್ಣವಾದ ತತ್ವಗಳನ್ನು ಸರಳಗೊಳಿಸಲು ವಿನ್ಯಾಸಗೊಳಿಸಿರುವಂತಹ ಮೋಜಿನ ಜೊತೆಗೆ ಉದ್ದೇಶದ ಸೈಡ್ ಪ್ರಾಜೆಕ್ಟ್‌ಗಳನ್ನು ರಚಿಸಲು ನನಗೆ ಆಸಕ್ತಿಯಿದೆ. ನಾನು ನಿರಂತರ ಕಲಿಕೆ ಮತ್ತು ಸಹಕಾರದ ಮೇಲಿನ ದೃಢ ನಂಬಿಕೆ ಹೊಂದಿದ್ದು, ಸದಾ ಹೊಸ ಸವಾಲುಗಳನ್ನು ಅರಿತುಕೊಳ್ಳಲು ಮತ್ತು ಹೊಸ ಆಲೋಚನೆಗಳನ್ನು ಮುಂದೆ ತರಲು ಸಿದ್ಧನಾಗಿದ್ದೇನೆ.",
		"p4": "ನಾವು ಸಂಪರ್ಕಿಸಿ, ಒಟ್ಟಾಗಿ ವಿಶೇಷವಾದುದನ್ನು ನಿರ್ಮಿಸೋಣ!"
	},
	"projects": {
		"CPU Scheduling Visualizer": {
			"description": "ಜೂನಿಯರ್‌ಗಳಿಗೆ ವಿವಿಧ CPU Scheduling Algorithms ನಡುವೆ ಇರುವ ವ್ಯತ್ಯಾಸಗಳನ್ನು ಸುಲಭವಾಗಿ ಅರ್ಥಮಾಡಿಕೊಳ್ಳಲು ಸಹಾಯ ಮಾಡುವ ಒಂದು ಸೈಡ್ ಪ್ರಾಜೆಕ್ಟ್ ಅಭಿವೃದ್ಧಿಪಡಿಸಲಾಗಿದೆ. ಈ ವೆಬ್‌ಸೈಟ್‌ನಲ್ಲಿ FCFS, SJF, RR, ಮತ್ತು Priority Scheduling ಅಲ್ಗೊರಿಥಮ್‌ಗಳನ್ನು ಒಳಗೊಂಡಿದೆ.",
			"heading": "ಸಿಪಿಯು ಷೆಡ್ಯೂಲಿಂಗ್ ವಿಸುಅಲೈಜ್ರ್"
		},
		"description": "ವಿವರಣೆ",
		"heading": "ಪ್ರಾಜೆಕ್ಟ್ಸ್",
		"Paying Guest Management System": {
			"description": "PG ಕಟ್ಟಡ ಮಾಲೀಕರಿಗಾಗಿ .NET ಮತ್ತು C# ಬಳಸಿಕೊಂಡು ಬಳಕೆದಾರರ ಸ್ನೇಹಪರ ಪೇಯಿಂಗ್ ಗೆಸ್ಟ್ ಮ್ಯಾನೇಜ್ಮೆಂಟ್ ಸಾಫ್ಟ್‌ವೇರ್ ಅಭಿವೃದ್ಧಿಪಡಿಸಲಾಗಿದೆ. ಇದು ಕೈಯಾರೆ ಮಾಡಿದ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ಬದಲಿಸಿ ಅತಿಥಿ ಮತ್ತು ಕಟ್ಟಡ ನಿರ್ವಹಣೆಯನ್ನು ಸುಗಮಗೊಳಿಸುತ್ತದೆ. ಇದರಲ್ಲಿ ಸಿಬ್ಬಂದಿ ನಿರ್ವಹಣೆ, ಅತಿಥಿಗಳನ್ನು ಸೇರಿಸುವುದು/ಅಗತ್ಯವಿಲ್ಲದಾಗ ತೆಗೆದುಹಾಕುವುದು, ಶುಲ್ಕ ಸಂಗ್ರಹಣೆ, ವಿಸಿಟರ್ ಟ್ರ್ಯಾಕಿಂಗ್ ಮತ್ತು ವರದಿ ರಚನೆ ಸೇರಿದಂತೆ ವೈಶಿಷ್ಟ್ಯಗಳಿವೆ.",
			"heading": "ಪೇಯಿಂಗ್ ಗೆಸ್ಟ್ ಮ್ಯಾನೇಜ್ಮೆಂಟ್ ಸಿಸ್ಟಮ್"
		},
		"Simple Library Surfer": {
			"description": "ಗ್ರಂತಾಲಯ ನಿರ್ವಹಣೆಗೆ .NET WinForms ಬಳಸಿ ಸುಸ್ಥಿರವಾದ CRUD ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ರಚಿಸಲಾಗಿದೆ, ಇದು ಗ್ರಂಥಪಾಲಕರಿಗೆ ಪುಸ್ತಕದ ಮಾಹಿತಿಯನ್ನು ಒಳಸೇರಿಸುವುದು, ಅಳಿಸುವುದು, ನವೀಕರಿಸುವುದು ಮತ್ತು ವೀಕ್ಷಿಸುವುದನ್ನು ಪರಿಣಾಮಕಾರಿಯಾಗಿ ನಿರ್ವಹಿಸಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ. ಈ ಅಪ್ಲಿಕೇಶನ್‌ವು PDF ವರದಿ ತಯಾರಿಕೆ ಮತ್ತು ಪ್ರಾಮುಖ್ಯತೆಯಿರುವ ಪುಸ್ತಕ ಹುಡುಕುವ ಹೆಚ್ಚಿನ ಸೌಲಭ್ಯವನ್ನು ಒಳಗೊಂಡಿದೆ.",
			"heading": "ಸಿಂಪಲ್ ಲೈಬ್ರರಿ ಸುರ್ಫ್ರ್"
		},
		"skills_learnt": "ಕಲಿತ ಕೌಶಲ್ಯಗಳು",
		"Solar System": {
			"description": "ನಮ್ಮ ಮಿಲ್ಕಿ ವೇ ಗ್ಯಾಲಕ್ಸಿಯಲ್ಲಿನ 'ಸೋಲಾರ್ ಸಿಸ್ಟಮ್' ಅನ್ನು ಪ್ರದರ್ಶಿಸುವ ಒಂದು ಸ್ತಿರ ವೆಬ್‌ಸೈಟ್. ಇದು ಅತಿರೇಕದ ಮಾಹಿತಿಯನ್ನು ತೊಡೆದುಹಾಕುತ್ತದೆ ಮತ್ತು ಗ್ರಹಗಳ ಒಟ್ಟಾರೆ ಮಾಹಿತಿಯನ್ನು ವೀಕ್ಷಿಸಲು ಚಿಕ್ಕ ಆದರೆ ಶಕ್ತಿಯುತವಾದ ವೆಬ್‌ಸೈಟ್ ಅನ್ನು ಒದಗಿಸುತ್ತದೆ.",
			"heading": "ಸೋಲಾರ್ ಸಿಸ್ಟಮ್"
		},
		"tech_stack": "ಟೆಕ್ ಸ್ಟಾಕ್",
		"view_code": "ಕೋಡ್ ವೀಕ್ಷಿಸಿ",
		"view_website": "ವೆಬ್‌ಸೈಟ್ ವೀಕ್ಷಿಸಿ"
	},
	"skills": {
		"backend": "ಬ್ಯಾಕ್ ಎಂಡ್",
		"frameworks_and_technologies": "ಫ್ರೇಮ್ವರ್ಕ್ಸ್ ಮತ್ತು ಟೆಕ್ನಾಲಜೀಸ್ ",
		"frontend": "ಫ್ರಂಟ್ ಎಂಡ್ ",
		"heading": "ಕೌಶಲ್ಯಗಳು"
	}
}
