{
	"app": {
		"lang": {
			"english": "ಆಂಗ್ಲ",
			"hindi": "ಹಿಂದಿ",
			"kannada": "ಕನ್ನಡ"
		}
	},
	"home": {
		"bha": "ಭಾ",
		"designation": "ಒಬ್ಬ ಭಾವೋದ್ರಿಕ್ತ ಸಾಫ್ಟ್‌ವೇರ್ ಡೆವಲಪರ್",
		"from": "ದಿಂದ",
		"hello": "ನಮಸ್ಕಾರ",
		"name_intro": "ನನ್ನ ಹೆಸರು ಕಾರ್ತಿಕ್",
		"ra": "ರ",
		"tha": "ತ"
	},
	"intro": {
		"about_me": "ನನ್ನ ಬಗ್ಗೆ",
		"p1": "ನಾನು ಒಬ್ಬ ಬಿಸಿಏ  ಪದವೀಧರನಾಗಿದ್ದೇನೆ, ಕೊಡ್‌ನೆಸ್ಟ್‌ನಲ್ಲಿ ತಲ್ಲೀನಗೊಳಿಸುವ ಇಂಟರ್ನ್‌ಶಿಪ್ ಸಮಯದಲ್ಲಿ ನಾನು ಜಾವಾ ಟೆಕ್ನಾಲಜಿ ಮೇಲೆ ಪರಿಣತಿ  ಹೊಂಧಿರುತೇನೆ . ಪ್ರಸ್ತುತ, ಸ್ಟಾರ್ ನಾಲೆಡ್ಜ್ ವೆಂಚರ್ಸ್‌ನಲ್ಲಿ ಟ್ರೈನಿ ಸಾಫ್ಟ್‌ವೇರ್ ಡೆವಲಪರ್ ಆಗಿ ಕೆಲಸ ಮಾಡುತಿದ್ದೇನೆ. ರಿಯಲ್ ಎಸ್ಟೇಟ್, ಹೆಲ್ತ್‌ಕೇರ್, ಸ್ಟಾಕ್ ಟ್ರೇಡಿಂಗ್ ಮತ್ತು ಹೆಚ್ಚಿನವುಗಳನ್ನು ವ್ಯಾಪಿಸಿರುವ ವೈವಿಧ್ಯಮಯ ಯೋಜನೆಗಳಲ್ಲಿ ಕೆಲಸ ಮಾಡಲು ನನಗೆ ಅವಕಾಶವಿದೆ. ಈ ಅನುಭವಗಳು ಡಾಟ್ ನೆಟ್ , ಆಂಗ್ಯುಲರ್ ಮತ್ತು ಅಜೂರ್ ತಂತ್ರಜ್ಞಾನಗಳಲ್ಲಿ ನಾನು ಕೌಶಲ್ಯನಾಗಿರುತೇನೆ. ಅದೇ ಸಮಯದಲ್ಲಿ ನಾವೀನ್ಯತೆ ಮತ್ತು ತಂಡದ ಕೆಲಸಕ್ಕಾಗಿ ನನ್ನ ಉತ್ಸಾಹ ಹೆಚ್ಚಿರುತ್ತದೆ.",
		"p2": "ದಕ್ಷ API ಗಳನ್ನು ರಚಿಸುವುದರಲ್ಲಿ, ಕಾರ್ಯಕ್ಷಮತೆಯನ್ನು ಉತ್ತಮಗೊಳಿಸುವುದರಲ್ಲಿ ಮತ್ತು ತಡೆರಹಿತ ಅಜುರ್  ನಿಯೋಜನೆಗಳನ್ನು ಸಾಕ್ಕ್ರಿಯ ಗೊಳಿಸುವಲ್ಲಿ  ನಾನು ಹೆಮ್ಮೆಪಡುತ್ತೇನೆ. ಸೈಟ್ ಲೋಡ್ ಸಮಯವನ್ನು 60% ರಷ್ಟು ಕಡಿತಗೊಳಿಸುವುದೇ ಆಗಲಿ ಅಥವಾ ದೃಢವಾದ ಅಪ್ಲಿಕೇಶನ್‌ಗಳನ್ನು ನಿರ್ಮಿಸುವುದೇ ಆಗಲಿ, ನಾನು ಪ್ರತಿ ಪ್ರಾಜೆಕ್ಟ್ ಅನ್ನು ಸ್ಪಷ್ಟ ಮನಸ್ಥಿತಿಯೊಂದಿಗೆ ಮತ್ತು ಫಲಿತಾಂಶಗಳ ಮೇಲೆ ಕೇಂದ್ರೀಕರಿಸುತ್ತೇನೆ.",
		"p3": "ನನ್ನ ಬಿಡುವಿನ ಸಮಯದಲ್ಲಿ, ಸೈಡ್ ಪ್ರಾಜೆಕ್ಟ್‌ಗಳನ್ನು ರಚಿಸುವುದನ್ನು ನಾನು ಆನಂದಿಸುತ್ತೇನೆ. ನನ್ನ CPU ಶೆಡ್ಯೂಲಿಂಗ್ ದೃಶ್ಯೀಕರಣದಂತಹ ವಿನೋದವನ್ನು ಸಂಯೋಜಿಸುವ , ಉದಯೋನ್ಮುಖ ಡೆವಲಪರ್‌ಗಳಿಗಾಗಿ ಸಂಕೀರ್ಣ ಪರಿಕಲ್ಪನೆಗಳನ್ನು ಸರಳೀಕರಿಸಲು ವಿನ್ಯಾಸಗೊಳಿಸಲಾಗಿದೆ. ನಾನು ನಿರಂತರ ಕಲಿಕೆ ಮತ್ತು ಸಹಯೋಗದಲ್ಲಿ ದೃಢ ನಂಬಿಕೆಯುಳ್ಳವನಾಗಿದ್ದೇನೆ, ಯಾವಾಗಲೂ ಹೊಸ ಸವಾಲುಗಳನ್ನು ಅನ್ವೇಷಿಸಲು ಮತ್ತು ತಾಜಾ ಆಲೋಚನೆಗಳಲ್ಲಿ ಉತ್ಸುಕನಾಗಿರುತ್ತೆನೆ .",
		"p4": "ನಾವು ಭೇಟಿ ಆಗಿ ಮತ್ತು ಒಟ್ಟಿಗೆ ಸೇರಿ ಗಮನಾರ್ಹವಾದದ್ದನ್ನು ನಿರ್ಮಿಸೋಣ!"
	},
	"projects": {
		"CPU Scheduling Visualizer": {
			"description": "ವಿವಿಧ CPU ಶೆಡ್ಯೂಲಿಂಗ್ ಅಲ್ಗಾರಿದಮ್‌ಗಳ ನಡುವಿನ ವ್ಯತ್ಯಾಸಗಳನ್ನು ಕಿರಿಯರಿಗೆ ಉತ್ತಮವಾಗಿ ಅರ್ಥಮಾಡಿಕೊಳ್ಳಲು ಸಹಾಯ ಮಾಡಲು ಒಂದು ಸೈಡ್ ಪ್ರಾಜೆಕ್ಟ್ ಅನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲಾಗಿದೆ. ಸೈಟ್ FCFS, SJF, RR, ಮತ್ತು ಆದ್ಯತೆಯ ವೇಳಾಪಟ್ಟಿ ಅಲ್ಗಾರಿದಮ್‌ಗಳನ್ನು ಒಳಗೊಂಡಿದೆ.",
			"heading": "ಸಿಪಿಯು ಷೆಡ್ಯೂಲಿಂಗ್ ವಿಸುಅಲೈಜ್ರ್"
		},
		"description": "ವಿವರಣೆ",
		"heading": "ಪ್ರಾಜೆಕ್ಟ್ಸ್",
		"Paying Guest Management System": {
			"description": "PG ಕಟ್ಟಡ ಮಾಲೀಕರಿಗಾಗಿ ಬಳಕೆದಾರ ಸ್ನೇಹಿ ಪೇಯಿಂಗ್ ಗೆಸ್ಟ್ ಮ್ಯಾನೇಜ್‌ಮೆಂಟ್ ಸಾಫ್ಟ್‌ವೇರ್ ಅನ್ನು ಸಿ ಜೊತೆಗೆ ಡಾಟ್‌ನೆಟ್ ಬಳಸಿ ಅಭಿವೃದ್ಧಿಪಡಿಸಲಾಗಿದೆ.",
			"heading": "ಪೇಯಿಂಗ್ ಗೆಸ್ಟ್ ಮ್ಯಾನೇಜ್ಮೆಂಟ್ ಸಿಸ್ಟಮ್"
		},
		"Simple Library Surfer": {
			"description": "ಲೈಬ್ರರಿ ನಿರ್ವಹಣೆಗಾಗಿ ದೃಢವಾದ .NET WinForms CRUD ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ರಚಿಸಲಾಗಿದೆ, ಅಳವಡಿಕೆ, ಅಳಿಸುವಿಕೆ, ನವೀಕರಿಸುವಿಕೆ ಮತ್ತು ವೀಕ್ಷಣೆ ಸೇರಿದಂತೆ ಪುಸ್ತಕದ ಡೇಟಾವನ್ನು ಸಮರ್ಥವಾಗಿ ನಿರ್ವಹಿಸಲು ಗ್ರಂಥಪಾಲಕರಿಗೆ ಅನುವು ಮಾಡಿಕೊಡುತ್ತದೆ. PDF ವರದಿ ಉತ್ಪಾದನೆ ಮತ್ತು ಸುಧಾರಿತ ಪುಸ್ತಕ ಹುಡುಕಾಟ ಕಾರ್ಯವನ್ನು ಹೊಂದಿದೆ.",
			"heading": "ಸಿಂಪಲ್ ಲೈಬ್ರರಿ ಸುರ್ಫ್ರ್"
		},
		"skills_learnt": "ಕಲಿತ ಕೌಶಲ್ಯಗಳು",
		"Solar System": {
			"description": "ಕ್ಷೀರಪಥ ಗ್ಯಾಲಕ್ಸಿಯಲ್ಲಿ ನಮ್ಮ 'ಸೋಲಾರ್ ಸಿಸ್ಟಮ್' ಅನ್ನು ಪ್ರದರ್ಶಿಸುವ ಸ್ಥಿರ ವೆಬ್‌ಸೈಟ್. ಇದು ಅನಗತ್ಯ ಡೇಟಾವನ್ನು ನಿವಾರಿಸುತ್ತದೆ ಮತ್ತು ಗ್ರಹಗಳ ಒಟ್ಟಾರೆ ಡೇಟಾವನ್ನು ವೀಕ್ಷಿಸಲು ಸಣ್ಣ ಮತ್ತು ಶಕ್ತಿಯುತವಾದ ವೆಬ್‌ಸೈಟ್ ಅನ್ನು ಒದಗಿಸುತ್ತದೆ.",
			"heading": "ಸೋಲಾರ್ ಸಿಸ್ಟಮ್"
		},
		"tech_stack": "ಟೆಕ್ ಸ್ಟಾಕ್",
		"view_code": "ಕೋಡ್ ವೀಕ್ಷಿಸಿ",
		"view_website": "ವೆಬ್‌ಸೈಟ್ ವೀಕ್ಷಿಸಿ"
	},
	"skills": {
		"backend": "ಬ್ಯಾಕ್ ಎಂಡ್",
		"frameworks_and_technologies": "ಫ್ರೇಮ್ವರ್ಕ್ಸ್ ಮತ್ತು ಟೆಕ್ನಾಲಜೀಸ್ ",
		"frontend": "ಫ್ರಂಟ್ ಎಂಡ್ ",
		"heading": "ಕೌಶಲ್ಯಗಳು"
	}
}
